---
kind: method
id: M:Autodesk.Revit.DB.Electrical.DistributionSysTypeSet.ForwardIterator
source: html/9d19a1b3-fcc8-53f5-4fd6-da094ee893fc.htm
---
# Autodesk.Revit.DB.Electrical.DistributionSysTypeSet.ForwardIterator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual DistributionSysTypeSetIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the set.